#### WorksetVisibility Enumeration

---

|  |
| --- |
| See Also |

Indicates the visibility settings of a workset in a particular view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum WorksetVisibility ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WorksetVisibility ``` |

| Visual C++ |
| --- |
| ``` public enum class WorksetVisibility ``` |

# Members

| Member name | Description |
| --- | --- |
| Visible | Be visible in a view (i.e. will be visible unless it is closed). |
| Hidden | Be hidden in a view. |
| UseGlobalSetting | Do not override the visibility. |

# See Also

Autodesk.Revit.DB Namespace